STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Source/STM32_WPAN/App/pbp_app.c
const PBPAPP_CodecConf_t aPBPAPP_CodecConf[NUM_LC3_CODEC_CONFIG] =    \
                  {{SAMPLE_FREQ_8000_HZ,FRAME_DURATION_7_5_MS,26u}, \
                  {SAMPLE_FREQ_8000_HZ,FRAME_DURATION_10_MS,30u}, \
                  {SAMPLE_FREQ_16000_HZ,FRAME_DURATION_7_5_MS,30u}, \
                  {SAMPLE_FREQ_16000_HZ,FRAME_DURATION_10_MS,40u}, \
                  {SAMPLE_FREQ_24000_HZ,FRAME_DURATION_7_5_MS,45u}, \
                  {SAMPLE_FREQ_24000_HZ,FRAME_DURATION_10_MS,60u}, \
                  {SAMPLE_FREQ_32000_HZ,FRAME_DURATION_7_5_MS,60u}, \
                  {SAMPLE_FREQ_32000_HZ,FRAME_DURATION_10_MS,80u}, \
                  {SAMPLE_FREQ_44100_HZ,FRAME_DURATION_7_5_MS,97u}, \
                  {SAMPLE_FREQ_44100_HZ,FRAME_DURATION_10_MS,130u}, \
                  {SAMPLE_FREQ_48000_HZ,FRAME_DURATION_7_5_MS,75u}, \
                  {SAMPLE_FREQ_48000_HZ,FRAME_DURATION_10_MS,100u}, \
                  {SAMPLE_FREQ_48000_HZ,FRAME_DURATION_7_5_MS,90u}, \
                  {SAMPLE_FREQ_48000_HZ,FRAME_DURATION_10_MS,120u}, \
                  {SAMPLE_FREQ_48000_HZ,FRAME_DURATION_7_5_MS,117u}, \
                  {SAMPLE_FREQ_48000_HZ,FRAME_DURATION_10_MS,155u}};


uint8_t aCodecPacketsMemory[MAX_PATH_NB][CODEC_POOL_SUB_SIZE];


/*Double buffer for an LC3 frame at source*/
uint16_t aPlayBuff[PLAY_BUFF_SIZE] __attribute__((aligned));

#if (BAP_BROADCAST_ENCRYPTION == 1)
uint32_t aPBPAPP_BroadcastCode[4u] = {0x00000001, 0x00000002, 0x00000003, 0x00000004};
#else /*(BAP_BROADCAST_ENCRYPTION == 1)*/
uint32_t aPBPAPP_BroadcastCode[4u] = {0x00000000, 0x00000000, 0x00000000, 0x00000000};
#endif /*(BAP_BROADCAST_ENCRYPTION == 1)*/

uint8_t aPBPAPP_BroadcastName[BROADCAST_NAME_LENGTH] = "PBP SOURCE";
uint32_t PreferredControllerDelay = 12000u;

/* Advertising Parameters */
BAP_Extended_Advertising_Params_t extended_adv_params = {
  0x00,          /* Advertising SID */
  100,           /* Advertising Interval min (*0.625) */
  100,           /* Adv Interval max (*0.625) */
  0x07,          /* Channel Map */
  0x00,          /* Own Address type */
  0x00,          /* Peer Address Type */
  {0,0,0,0,0,0}, /* Peer Address */
  0x7F,          /* TX Power */
  0x00,          /* Secondary Advertising Max Skip */
  0x01           /* Secondary Adv PHY */
};
BAP_Periodic_Advertising_Params_t periodic_adv_params = {
  64,  /* Advertising Interval Min */
  64,  /* Advertising Interval Max */
  0x00 /* Advertising Properties */
};

/* Private functions prototypes-----------------------------------------------*/
static tBleStatus PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role);
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification);
static void PBPAPP_SetupBASE(uint8_t Encryption,
                             uint32_t *pBroadcastCode,
                             uint8_t MetadataLen,
                             uint8_t *pMetadata,
                             uint8_t NumBIS,
                             uint8_t BAPConfID,
                             uint32_t *pChannelAllocation,
                             uint8_t *pFrameBlockPerSDU);
static tBleStatus PBPAPP_BroadcastSetupAudio(Audio_Role_t role);
static void PBPAPP_StartBroadcastAudio(Audio_Role_t role);
static uint8_t PBPAPP_BuildManufacturerAvertisingData(uint8_t *pAdvData, uint8_t AdvDataLen);
static void start_audio_source(void);
static void start_audio_sink(void);
/* Exported functions --------------------------------------------------------*/
extern void APP_NotifyToRun(void);

/* Functions Definition ------------------------------------------------------*/
/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_Notification(CAP_Notification_Evt_t *pNotification)
{
  /* Notify PBP */
  CAP_PBP_Notification(pNotification);

  /* Notify App */
  CAP_App_Notification(pNotification);
}


/**
  * @brief  Notify PBP Events
  * @param  pNotification: pointer on notification information
 */
void PBP_Notification(PBP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {

    case PBP_PBS_BROADCAST_AUDIO_STARTED_EVT:
      {
        CAP_Broadcast_AudioStarted_Info_t *data = (CAP_Broadcast_AudioStarted_Info_t*) pNotification->pInfo;
        APP_DBG_MSG(">>== PBP_PBS_BROADCAST_AUDIO_STARTED_EVT\n");
        APP_DBG_MSG("     - Status = 0x%02X\n",pNotification->Status);
        APP_DBG_MSG("     - BIG_Handle : 0x%02x\n",BIG_HANDLE);
        if (pNotification->Status == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("     - Num Created BISes = %d\n",data->NumBISes);
        }
        PBPAPP_Context.current_num_bis = data->NumBISes;

        UTIL_MEM_cpy_8(&(PBPAPP_Context.current_BIS_conn_handles[0]),
                       data->pConnHandle,
                       (data->NumBISes * sizeof(uint16_t)));

        (void)PBPAPP_BroadcastSetupAudio(AUDIO_ROLE_SOURCE);
      }
      break;
    case PBP_BROADCAST_AUDIO_UP_EVT:
      {
      }
      break;
    case PBP_BROADCAST_AUDIO_DOWN_EVT:
    {
      MX_AudioDeInit();
      APP_DBG_MSG(">>== PBP_BROADCAST_AUDIO_DOWN_EVT\n");
    }
    break;


   default:
      break;
  }
  return;
}

/**
  * @brief The BLE Audio Stack requests to be executed. BLE_AUDIO_STACK_Task() shall be called.
  * @note  If the Host task is executed in a separate thread, the thread shall be unlocked here.
  */
void BLE_AUDIO_STACK_NotifyToRun(void)
{
  APP_NotifyToRun();
}

/**
  * @brief Initialize PBP Source and Start Broadcast Audio Procedure.
  */
uint8_t PBPAPP_InitSource(void)
{
  uint8_t ret = 0;
  uint32_t a_channel_allocation[2] = {BROADCAST_SOURCE_CHANNEL_ALLOC_1, BROADCAST_SOURCE_CHANNEL_ALLOC_2};
  uint8_t a_frame_block_per_sdu[2] = {BROADCAST_SOURCE_FRAME_BLOCK_PER_SDU, BROADCAST_SOURCE_FRAME_BLOCK_PER_SDU};
  uint8_t metadata_len = 4;
  uint8_t a_metadata[4] = {0x03, METADATA_STREAMING_AUDIO_CONTEXTS,
                           STREAMING_AUDIO_CONTEXT & 0xFF,
                           (STREAMING_AUDIO_CONTEXT >> 8) & 0xFF};

