STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Source/STM32_WPAN/App/pbp_app.c
  PreferredControllerDelay = BROADCAST_CONTROLLER_DELAY;

  APP_DBG_MSG(">>==  Start CAP Initiator initialization\n");
  ret = PBPAPP_Init(CAP_ROLE_INITIATOR, BAP_ROLE_BROADCAST_SOURCE);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : PBPAPP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: PBPAPP_Init() function\n");
  }

  /*Enable Audio Codec in LE Controller */
  PBPAPP_Context.aStandardCodec[0].CodingFormat = AUDIO_CODING_FORMAT_LC3;
  PBPAPP_Context.aStandardCodec[0].TransportMask = 0x01; /*CIS Transport Type only*/
  PBPAPP_Context.AudioCodecInController.NumStandardCodecs = 0x01;
  PBPAPP_Context.AudioCodecInController.pStandardCodec = &PBPAPP_Context.aStandardCodec[0];
  PBPAPP_Context.AudioCodecInController.NumVendorSpecificCodecs = 0x00;
  PBPAPP_Context.AudioCodecInController.pVendorSpecificCodec = (void *)0;

  ret = CAP_EnableAudioCodecController(&PBPAPP_Context.AudioCodecInController);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : CAP_EnableAudioCodecController() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: CAP_EnableAudioCodecController() function\n");
  }

  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_HEADSET;

  PBPAPP_SetupBASE(BAP_BROADCAST_ENCRYPTION,
                   aPBPAPP_BroadcastCode,
                   metadata_len,
                   a_metadata,
                   BROADCAST_SOURCE_NUM_BIS,
                   BROADCAST_SOURCE_BAP_CONFIG,
                   a_channel_allocation,
                   a_frame_block_per_sdu);

  if (aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].Freq == SAMPLE_FREQ_48000_HZ
     && (BROADCAST_SOURCE_NUM_BIS == 2
       || LTV_GetNumberOfChannelsSet(BROADCAST_SOURCE_CHANNEL_ALLOC_1) == 2))
  {
    /* Reduce RTN */
    PBPAPP_Context.RTN = 1;
  }

  ret = PBP_Init(PBP_ROLE_PUBLIC_BROADCAST_SOURCE);

  APP_DBG_MSG(">>==  End CAP Initiator initialization\n");
  return ret;
}

uint8_t PBPAPP_StartSource(void)
{
  uint8_t ret;
  uint8_t a_additional_adv_data[6+16] = {5u,
                                         AD_TYPE_COMPLETE_LOCAL_NAME,
                                         (uint8_t) 'P',
                                         (uint8_t) 'B',
                                         (uint8_t) 'P',
                                         (uint8_t) '1'};
  PBP_PBS_BroadcastAudioStart_Params_t pbp_audio_start_params;
  CAP_Broadcast_AudioStart_Params_t cap_audio_start_params;

  pbp_audio_start_params.pBroadcastAudioStartParams = &cap_audio_start_params;
  pbp_audio_start_params.StandardQuality = 0;
  pbp_audio_start_params.HighQuality = 0;
  pbp_audio_start_params.pAdvMetadata = 0;
  pbp_audio_start_params.AdvMetadataLen = 0;
  pbp_audio_start_params.pBroadcastName = &aPBPAPP_BroadcastName[0];
  pbp_audio_start_params.BroadcastNameLen = BROADCAST_NAME_LENGTH;
  pbp_audio_start_params.Appearance = APPEARANCE;

  cap_audio_start_params.pBaseGroup = &PBPAPP_Context.base_group;
  cap_audio_start_params.BigHandle = 0;
  cap_audio_start_params.Rtn = PBPAPP_Context.RTN;
  cap_audio_start_params.Phy = 0x02;
  cap_audio_start_params.Packing = BAP_PACKING_SEQUENTIAL;
  cap_audio_start_params.MaxTransportLatency = PBPAPP_Context.max_transport_latency;
  cap_audio_start_params.Encryption = PBPAPP_Context.encryption;
  cap_audio_start_params.pBroadcastCode = &PBPAPP_Context.broadcast_code[0];
  cap_audio_start_params.AdvHandle = 0;
  cap_audio_start_params.pExtendedAdvParams = &extended_adv_params;
  cap_audio_start_params.pPeriodicAdvParams = &periodic_adv_params;
  cap_audio_start_params.pAdditionalAdvData = &a_additional_adv_data[0];
  cap_audio_start_params.AdditionalAdvDataLen = 6;


  if (BROADCAST_SOURCE_BAP_CONFIG%16 == 3 || BROADCAST_SOURCE_BAP_CONFIG%16 == 5)
  {
    pbp_audio_start_params.StandardQuality = 1u;
  }
  else if (BROADCAST_SOURCE_BAP_CONFIG%16 >= 10)
  {
    pbp_audio_start_params.HighQuality = 1u;
  }

  cap_audio_start_params.AdditionalAdvDataLen += PBPAPP_BuildManufacturerAvertisingData(
                                                 &(a_additional_adv_data[cap_audio_start_params.AdditionalAdvDataLen]),
                                                 16);

  APP_DBG_MSG("  Start Broadcast Audio\n");
  ret = PBP_PBS_BroadcastAudioStart(&pbp_audio_start_params);

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : PBP_PBS_BroadcastAudioStart() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: PBP_PBS_BroadcastAudioStart() function\n");
  }

  return ret;
}

uint8_t PBPAPP_StopSource(void)
{
  uint8_t ret;

  APP_DBG_MSG("  Stop Broadcast Audio\n");
  ret = PBP_PBS_BroadcastAudioStop(BIG_HANDLE, 1);

  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : PBP_PBS_BroadcastAudioStop() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: PBP_PBS_BroadcastAudioStop() function\n");
  }

  return ret;
}

void APP_NotifyRxAudioCplt(uint16_t AudioFrameSize)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SOURCE)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_SendData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aPlayBuff[0] + AudioFrameSize/2 + i);
    }
  }
}

void APP_NotifyRxAudioHalfCplt(void)
{
  uint8_t i;

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SOURCE)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_SendData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &aPlayBuff[0] + i);
    }
  }
}

void APP_NotifyTxAudioCplt(uint16_t AudioFrameSize)
{
  UNUSED(AudioFrameSize);
}

void APP_NotifyTxAudioHalfCplt(void)
{

}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification)
{

  switch (pNotification->EvtOpcode)
  {
    case CAP_CODEC_CONFIGURED_EVT:
      {
        APP_DBG_MSG(">>== CAP_CODEC_CONFIGURED_EVT\n");
        Sampling_Freq_t *freq = (Sampling_Freq_t *)pNotification->pInfo;
        APP_DBG_MSG("     - Sample Frequency Type:   0x%02X\n",*freq);
        APP_DBG_MSG("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",*freq);
        AudioClock_Init(*freq);
      }
      break;
  }
}

static uint8_t PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role)
{
  tBleStatus ret = 0;
  /* Initialize the Audio IP*/
  BleAudioInit.NumOfLinks = CFG_BLE_NUM_LINK;
  BleAudioInit.bleStartRamAddress = (uint8_t*)aAudioInitBuffer;
  BleAudioInit.total_buffer_size = BLE_AUDIO_DYN_ALLOC_SIZE;
  ret = BLE_AUDIO_STACK_Init(&BleAudioInit);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("  Fail   : BLE_AUDIO_STACK_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("  Success: BLE_AUDIO_STACK_Init() function\n");
    APP_DBG_MSG("BLE Audio Stack Lib version: %s\n", BLE_AUDIO_STACK_GetFwVersion());
  }
  if (ret == BLE_STATUS_SUCCESS)
  {
    /*Clear the CAP Configuration*/
    memset(&PBPAPP_CAP_Config,0,sizeof(PBPAPP_CAP_Config));

