STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Source/STM32_WPAN/App/pbp_app.c
    /*Clear the BAP Configuration*/
    memset(&PBPAPP_BAP_Config,0,sizeof(PBPAPP_BAP_Config));

    /*Clear the CCP Configuration*/
    memset(&PBPAPP_CCP_Config,0,sizeof(CCP_Config_t));

    /*Clear the MCP Configuration*/
    memset(&PBPAPP_MCP_Config,0,sizeof(MCP_Config_t));

    /*Clear the VCP Configuration*/
    memset(&PBPAPP_VCP_Config,0,sizeof(VCP_Config_t));

    /*Clear the VCP Configuration*/
    memset(&PBPAPP_MICP_Config,0,sizeof(MICP_Config_t));

    /*Clear the CSIP Configuration*/
    memset(&PBPAPP_CSIP_Config,0,sizeof(CSIP_Config_t));

    PBPAPP_CAP_Config.Role = CAP_Role;
    PBPAPP_CAP_Config.MaxNumLinks = CFG_BLE_NUM_LINK;

    PBPAPP_CAP_Config.pStartRamAddr = (uint8_t *)&aCAPMemBuffer;
    PBPAPP_CAP_Config.RamSize = CAP_DYN_ALLOC_SIZE;

    PBPAPP_BAP_Config.Role = BAP_Role;

    PBPAPP_BAP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;

    /*Isochronous Channels Configuration*/
    PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCIG = 0;
    PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCISPerCIG = 0;
    PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBIG = MAX_NUM_BIG;
    PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBISPerBIG = MAX_NUM_BIS_PER_BIG;
    PBPAPP_BAP_Config.ISOChnlConfig.pStartRamAddr = 0;
    PBPAPP_BAP_Config.ISOChnlConfig.RamSize = 0u;

    /* Initialize the Basic Audio Profile*/
    ret = CAP_Init(&PBPAPP_CAP_Config,
                   &PBPAPP_BAP_Config,
                   &PBPAPP_VCP_Config,
                   &PBPAPP_MICP_Config,
                   &PBPAPP_CCP_Config,
                   &PBPAPP_MCP_Config,
                   &PBPAPP_CSIP_Config);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : CAP_Init() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: CAP_Init() function\n");
    }
    if (ret == BLE_STATUS_SUCCESS)
    {

      /*Initialize the Audio Codec (LC3)*/
      CODEC_LC3Config_t lc3_config = {0};
      PBPAPP_Context.bap_role = PBPAPP_BAP_Config.Role;

      /*Register the Audio Task */
      UTIL_SEQ_RegTask( 1<<CFG_TASK_AUDIO_ID, UTIL_SEQ_RFU, BLE_AUDIO_STACK_Task);

      lc3_config.NumDecChannel = CODEC_LC3_NUM_DECODER_CHANNEL;
      lc3_config.NumEncChannel = CODEC_LC3_NUM_ENCODER_CHANNEL;
      lc3_config.NumSession = CODEC_LC3_NUM_SESSION;

#if (CODEC_LC3_NUM_SESSION > 0u)
      lc3_config.pSessionStart = aLC3SessionMemBuffer;
#endif /* CODEC_LC3_NUM_SESSION */
#if (CODEC_LC3_NUM_ENCODER_CHANNEL > 0u)
      lc3_config.pEncChannelStart = aLC3EncoderMemBuffer;
#endif /* CODEC_LC3_NUM_ENCODER_CHANNEL */
#if (CODEC_LC3_NUM_DECODER_CHANNEL > 0u)
      lc3_config.pDecChannelStart = aLC3DecoderMemBuffer;
#endif /* CODEC_LC3_NUM_DECODER_CHANNEL */

      CODEC_ManagerInit(MAX_PATH_NB*CODEC_POOL_SUB_SIZE,(uint8_t*)aCodecPacketsMemory, &lc3_config, 100u, 1700u);
    }
  }
  return ret;
}

static void PBPAPP_SetupBASE(uint8_t Encryption,
                             uint32_t *pBroadcastCode,
                             uint8_t MetadataLen,
                             uint8_t *pMetadata,
                             uint8_t NumBIS,
                             uint8_t BAPConfID,
                             uint32_t *pChannelAllocation,
                             uint8_t *pFrameBlockPerSDU)
{
  uint8_t i;

  /* Init Broadcast Source Configuration */
  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_LINEIN;
  PBPAPP_Context.phy = TARGET_LE_2M_PHY;

  PBPAPP_Context.base_bis[0].BIS_Index = 0x01;
  PBPAPP_Context.base_bis[0].CodecSpecificConfLength = 0x06;
  PBPAPP_Context.base_bis[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[0][0]);

  PBPAPP_Context.base_bis[1].BIS_Index = 0x02;
  PBPAPP_Context.base_bis[1].CodecSpecificConfLength = 0x06;
  PBPAPP_Context.base_bis[1].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[1][0]);

  PBPAPP_Context.base_subgroups[0].NumBISes = NumBIS;
  PBPAPP_Context.base_subgroups[0].pBIS = &(PBPAPP_Context.base_bis[0]);
  PBPAPP_Context.base_subgroups[0].CodecID = 0x0000000006; /* LC3 */
  PBPAPP_Context.base_subgroups[0].CodecSpecificConfLength = 0x0D;
  PBPAPP_Context.base_subgroups[0].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[0][0]);
  UTIL_MEM_cpy_8(PBPAPP_Context.subgroup_metadata[0], &(pMetadata[0]), MetadataLen);
  PBPAPP_Context.base_subgroups[0].pMetadata = &PBPAPP_Context.subgroup_metadata[0][0];
  PBPAPP_Context.base_subgroups[0].MetadataLength = MetadataLen;

  PBPAPP_Context.base_group.NumSubgroups = 1;
  PBPAPP_Context.base_group.pSubgroups = &(PBPAPP_Context.base_subgroups[0]);

  PBPAPP_Context.encryption = Encryption;
  PBPAPP_Context.broadcast_code[0] = pBroadcastCode[0];
  PBPAPP_Context.broadcast_code[1] = pBroadcastCode[1];
  PBPAPP_Context.broadcast_code[2] = pBroadcastCode[2];
  PBPAPP_Context.broadcast_code[3] = pBroadcastCode[3];

  PBPAPP_Context.RTN = 1u;
  uint8_t subgroup_i = 0;
  uint8_t same_fbpsdu_conf = 1u;

  for (i = 1; i < NumBIS; i++)
  {
    if (pFrameBlockPerSDU[i-1] != pFrameBlockPerSDU[i])
    {
      same_fbpsdu_conf = 0;
    }
  }

  PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength = 0;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = CODEC_SAMPLING_FREQ;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = aPBPAPP_CodecConf[BAPConfID%16].Freq;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = CODEC_FRAME_DURATION;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = aPBPAPP_CodecConf[BAPConfID%16].FrameDuration;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = 0x03;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = CODEC_OCTETS_PER_CODEC_FRAME;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = (uint8_t) aPBPAPP_CodecConf[BAPConfID%16].OctetsPerCodecFrame;
  PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = (uint8_t) (aPBPAPP_CodecConf[BAPConfID%16].OctetsPerCodecFrame >> 8);

  PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength += 10;

  if (same_fbpsdu_conf == 1u)
  {
    PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = 0x02;
    PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = CODEC_FRAMES_BLOCKS_PER_SDU;
    PBPAPP_Context.codec_specific_config_subgroup[0][subgroup_i++] = pFrameBlockPerSDU[0];

