STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_PBP_Source/STM32_WPAN/App/pbp_app.c
    PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength += 3;
  }


  for (i = 0; i < NumBIS; i++)
  {
    uint8_t bis_i = 0;
    /* Take max RTN and transport latency */
    PBPAPP_Context.RTN = MAX(PBPAPP_Context.RTN, aPBPAPP_BroadcastQoSConf[BAPConfID].RTN);
    PBPAPP_Context.max_transport_latency = MAX( PBPAPP_Context.max_transport_latency,
                                               aPBPAPP_BroadcastQoSConf[BAPConfID].MaxTpLatency);
    PBPAPP_Context.base_group.PresentationDelay = MAX(PBPAPP_Context.base_group.PresentationDelay,
                                                      aPBPAPP_BroadcastQoSConf[BAPConfID].PresentationDelay);

    PBPAPP_Context.base_group.pSubgroups[0].pBIS[i].CodecSpecificConfLength = 0;

    if (same_fbpsdu_conf == 0u)
    {
      PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0x02;
      PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = CODEC_FRAMES_BLOCKS_PER_SDU;
      PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = pFrameBlockPerSDU[i];

      PBPAPP_Context.base_group.pSubgroups[0].pBIS[i].CodecSpecificConfLength += 3;
    }

    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = 0x05;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = CODEC_AUDIO_CHNL_ALLOCATION;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = pChannelAllocation[i] & 0xFF;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = (pChannelAllocation[i] >> 8) & 0xFF;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = (pChannelAllocation[i] >> 16) & 0xFF;
    PBPAPP_Context.codec_specific_config_bis[i][bis_i++] = (pChannelAllocation[i] >> 24) & 0xFF;

    PBPAPP_Context.base_group.pSubgroups[0].pBIS[i].CodecSpecificConfLength += 6;
  }
}

static void PBPAPP_StartBroadcastAudio(Audio_Role_t role)
{
  if (role == AUDIO_ROLE_SOURCE)
  {
    CODEC_RegisterTriggerClbk(1,0,&start_audio_source);
  }
  else if (role == AUDIO_ROLE_SINK)
  {
    CODEC_RegisterTriggerClbk(1,1,&start_audio_sink);
  }
}

static tBleStatus PBPAPP_BroadcastSetupAudio(Audio_Role_t role)
{
  Sampling_Freq_t sampling_freq;
  Frame_Duration_t frame_duration;
  uint8_t direction = DATA_PATH_INPUT;
  uint32_t controller_delay, controller_delay_min, controller_delay_max;
  uint8_t a_codec_id[5] = {0x00,0x00,0x00,0x00,0x00};
  tBleStatus ret;

  APP_DBG_MSG("==>> Start PBPAPP_BroadcastSetupAudio function\n");

  a_codec_id[0] = AUDIO_CODING_FORMAT_LC3;

  sampling_freq = LTV_GetConfiguredSamplingFrequency(
      &PBPAPP_Context.base_group.pSubgroups[0].pCodecSpecificConf[0],
      PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength);

  frame_duration = LTV_GetConfiguredFrameDuration(
      &PBPAPP_Context.base_group.pSubgroups[0].pCodecSpecificConf[0],
      PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength);

  if ((sampling_freq != 0) && (frame_duration != 0xFF))
  {
    PBPAPP_StartBroadcastAudio(role);
    MX_AudioInit(role,
                 sampling_freq,
                 frame_duration,
                 0,
                 (uint8_t *)aPlayBuff,
                 (AudioDriverConfig)PBPAPP_Context.audio_driver_config);

    if (role == AUDIO_ROLE_SINK)
    {
      direction = DATA_PATH_OUTPUT;
      CAP_Broadcast_ReadSupportedControllerDelay(PBPAPP_Context.current_num_bis,
                                                 DATA_PATH_OUTPUT,
                                                 a_codec_id,
                                                 &controller_delay_min,
                                                 &controller_delay_max);

      /* choice of implementation : we try to use as much as possible the controller RAM for delaying before the application RAM*/
      controller_delay = PBPAPP_Context.base_group.PresentationDelay - APP_DELAY_SNK_MIN;

      /* check that we don't exceed the maximum value */
      if ( controller_delay > controller_delay_max)
      {
        controller_delay = controller_delay_max;
        APP_DBG_MSG("Controller delay chosen to maximum value %d us\n",controller_delay);
      }
      else
      {
        APP_DBG_MSG("Controller delay chosen to %d us\n",controller_delay);
      }

      /* compute the application delay */
      APP_DBG_MSG("Expecting application to respect the delay of %d us\n",
                  (PBPAPP_Context.base_group.PresentationDelay - controller_delay));
      if ((PBPAPP_Context.base_group.PresentationDelay - controller_delay) > APP_DELAY_SNK_MAX)
      {
        APP_DBG_MSG("Warning, could not respect the presentation delay value");
      }
    }
    else
    {
      /* AUDIO_ROLE_SOURCE */
      direction = DATA_PATH_INPUT;
      CAP_Broadcast_ReadSupportedControllerDelay(PBPAPP_Context.current_num_bis,
                                                 DATA_PATH_INPUT,
                                                 a_codec_id,
                                                 &controller_delay_min,
                                                 &controller_delay_max);

      /* at source we don't have to respect a presentation delay */
      controller_delay = PreferredControllerDelay;
      if ( controller_delay > controller_delay_max)
      {
        controller_delay = controller_delay_max;
        APP_DBG_MSG("Controller delay chosen to value %d us\n", controller_delay);
      }
    }

    CODEC_DataPathParam_t param;
    /* sample coded on 16bits */
    param.SampleDepth = 16;

    /* SAI/I2C peripheral driver requests to set decimation to 2 (stereo buffer)*/
    param.Decimation = 2;

    ret = CAP_Broadcast_SetupAudioDataPath(PBPAPP_Context.current_num_bis,
                                            &PBPAPP_Context.current_BIS_conn_handles[0],
                                            direction,
                                            a_codec_id,
                                            controller_delay,
                                            DATA_PATH_CIRCULAR_BUF,
                                            CONFIGURE_DATA_PATH_CONFIG_LEN,
                                            (const uint8_t*) &param);

    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("  Fail   : CAP_Broadcast_SetupAudioDataPath() function, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("  Success: CAP_Broadcast_SetupAudioDataPath() function\n");
    }
  }
  else
  {
    APP_DBG_MSG("Sampling Frequency in LTV is invalid\n");
    ret = BLE_STATUS_FAILED;
  }
  APP_DBG_MSG("==>> End PBPAPP_BroadcastSetupAudio function\n");
  return ret;
}


/*Audio Source */
static void start_audio_source(void)
{
  Start_RxAudio();
}

/*Audio Sink */
static void start_audio_sink(void)
{
  Start_TxAudio();
}

static uint8_t PBPAPP_BuildManufacturerAvertisingData(uint8_t *pAdvData, uint8_t AdvDataLen)
{
  if (AdvDataLen >= 16)
  {
    uint8_t bd_addr[6];
    uint8_t length;

    /* Length */
    pAdvData[0] = 15;

    /* Type: Manufacturer Data */
    pAdvData[1] = 0xFF;

    /* ST Company ID */
    pAdvData[2] = 0x30;
    pAdvData[3] = 0x00;

    /* BlueSTSDK protocol version */
    pAdvData[4] = 0x02;

    /* Board ID: Discovery Kit WBA */
    pAdvData[5] = 0x8C;

    /* Firmware ID: Public Broadcast Source */
    pAdvData[6] = 0x90;

    /* Source ID*/
    pAdvData[7] = BAP_BROADCAST_SOURCE_ID & 0xFF;
    pAdvData[8] = (BAP_BROADCAST_SOURCE_ID >> 8) & 0xFF;
    pAdvData[9] = (BAP_BROADCAST_SOURCE_ID >> 16) & 0xFF;

    /* BD Address */
    aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &length, &(bd_addr[0]));
    pAdvData[10] = bd_addr[0];
    pAdvData[11] = bd_addr[1];
    pAdvData[12] = bd_addr[2];
    pAdvData[13] = bd_addr[3];
    pAdvData[14] = bd_addr[4];
    pAdvData[15] = bd_addr[5];

    return 16;
  }
  else
  {
    /* Advertising Data size insufficient */
    return 0;
  }
}